Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.Father Property
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSet Father { get; set; }
Public Property Father As RebarSet
	Get
	Set
Property Value
Type: RebarSet
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace